[
    {
        "id": 1,
        "name": "Hiroshi",
        "photoUrl": "https://example.com/hiroshi.jpg",
        "experience": "10 years",
        "num_of_recipes": 79,
        "like": 6545,
        "recipes": [
            {
                "name": "Soba Noodles with Miso Sauce",
                "ingredients": [
                    "8 ounces soba noodles",
                    "1/4 cup white miso paste",
                    "1/4 cup mirin",
                    "1/4 cup sake",
                    "2 tablespoons soy sauce",
                    "1 tablespoon sesame oil",
                    "2 green onions, sliced thinly"
                ],
                "cooking_method": "1. Cook the soba noodles according to the package instructions. Drain and rinse under cold water.\n2. In a bowl, whisk together the white miso paste, mirin, sake, soy sauce, and sesame oil until smooth.\n3. Toss the cooked soba noodles with the miso sauce until well coated.\n4. Divide the noodles among bowls and sprinkle with sliced green onions."
            },
            {
                "name": "Grilled Miso Salmon",
                "ingredients": [
                    "4 salmon fillets",
                    "1/4 cup white miso paste",
                    "1/4 cup mirin",
                    "1/4 cup sake",
                    "2 tablespoons sugar",
                    "1 tablespoon grated ginger",
                    "2 cloves garlic, minced"
                ],
                "cooking_method": "1. In a bowl, whisk together the white miso paste, mirin, sake, sugar, grated ginger, and minced garlic.\n2. Place the salmon fillets in a shallow dish and pour the miso marinade over them. Cover and refrigerate for at least 30 minutes.\n3. Preheat a grill or grill pan over medium-high heat.\n4. Remove the salmon fillets from the marinade, shaking off any excess, and grill for 3-4 minutes on each side, until cooked through.\n5. Serve the grilled miso salmon with steamed rice and vegetables."
            },
            {
                "name": "Gyudon - Beef Bowl",
                "ingredients": [
                    "1 pound thinly sliced beef",
                    "1 onion, sliced thinly",
                    "1/4 cup sake",
                    "1/4 cup mirin",
                    "1/4 cup soy sauce",
                    "2 tablespoons sugar",
                    "2 cups cooked rice"
                ],
                "cooking_method": "1. In a large skillet or wok, cook the thinly sliced beef over high heat until browned and cooked through. Remove from the skillet and set aside.\n2. In the same skillet, sauté the sliced onion until softened.\n3. Add the sake, mirin, soy sauce, and sugar to the skillet and bring to a boil.\n4. Add the cooked beef back to the skillet and simmer for a few minutes until the sauce thickens.\n5. Serve the gyudon over cooked rice."
            }
        ]
    }
]